//==== Task-1 ===================
// Выведется ли alert?

if ("0") {
   alert( 'Привет' );
}

// Да, т.к. '0' == true

//==== Task-4 ===================
// Перепишите конструкцию if с использованием условного оператора '?'

let result;

// if (a + b < 4) {
//   result = 'Мало';
// } else {
//   result = 'Много';
// }

result = (a + b < 4) ? 'Мало' : 'Много';

//==== Task-5 ===================
//Перепишите if..else с использованием нескольких операторов '?'.
//Для читаемости рекомендуется разбить код на несколько строк.

let message;

// if (login == 'Сотрудник') {
//   message = 'Привет';
// } else if (login == 'Директор') {
//   message = 'Здравствуйте';
// } else if (login == '') {
//   message = 'Нет логина';
// } else {
//   message = '';
// }

message = (login == 'Сотрудник') ? 'Привет' :
   (login == 'Директор') ? 'Здравствуйте' : 
   (login == '') ? 'Нет логина' : '';