//==== Task-1 ===================

// 1) Объявите две переменные: admin и name.
let admin;
let name;

// 2) Запишите строку "Джон" в переменную name.
name = "Джон";

// 3) Скопируйте значение из переменной name в admin.
admin = name;

// 4) Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).
alert(admin);

//==== Task-2 ===================
// 1) Создайте переменную для названия нашей планеты. Как бы вы её назвали?
let ourPlanetName = "Земля";
// 2) Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?
let currentUserName;